src/ml/deep-learning/deep-learning.org
#+TITLE: 深度学习入门
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil  ^:nil

深度学习改变了传统互联网业务，例如如网络搜索和广告。但是深度学习同时也使得许多新产品和企业以很多方式帮助人们，从获得更好的健康关注。

#+begin_example
  深度学习做的非常好的一个方面就是读取X光图像，到生活中的个性化教育，到精准化农业，甚至到驾驶汽车以及其它一些方面
#+end_example

AI是最新的电力，大约在一百年前，社会的电气化改变了每个主要行业，从交通运输行业到制造业、医疗保健、通讯等方面，如今我们见到了AI明显的令人惊讶的能量，带来了同样巨大的转变。显然，AI的各个分支中，发展的最为迅速的就是深度学习。因此现在，深度学习是在科技世界中广受欢迎的一种技巧

1. 第一章节中（神经网络和深度学习）：学习神经网络的基础
   #+begin_example
     在第一门课程中，将学习如何建立神经网络（包含一个深度神经网络），以及如何在数据上面训练他们

     在这门课程的结尾，将用一个深度神经网络进行辨认猫
   #+end_example
2. 第二章节：进行深度学习方面的实践，学习严密地构建神经网络，如何真正让它表现良好，因此要学习 _超参数调整_ 、 _正则化_ 、 _诊断偏差_ 和 _方差_
   #+begin_example
     一些高级优化算法，比如Momentum和Adam算法，犹如黑魔法一样根据你建立网络的方式
   #+end_example
3. 第三章节：学习如何结 *构化* 你器学习工程。事实证明，构建机器学习系统的策略改变了深度学习的错误
   #+begin_example
     举个例子：分割数据的方式，分割成训练集、比较集或改变的验证集，以及测试集合，改变了深度学习的错误

     最好的实践方式是什么呢？训练集和测试集来自不同的贡献度在深度学习中的影响很大，那么应该怎么处理呢？
   #+end_example
4. 第四章节：会提到 *卷积神经网络* _CNN(s)_ ，它经常被用于 _图像领域_
   #+begin_example
     将会学到如何搭建这样的模型
   #+end_example
5. 第五章节：会学习到 *序列模型* ，以及如何将它们应用于 _自然语言处理_ 。序列模型包括的模型有 *循环神经网络* _RNN_ 、全称是 *长短期记忆网络* _LSTM_
   #+begin_example
     比如说，自然语言就是一个单词序列

     能够理解这些模型如何应用到语音识别或者是编曲以及其它问题
   #+end_example

因此，通过这些，将学习深度学习的这些工具，将能够去使用它们去做一些神奇的事情

+ [[file:neural-network/neural-network.org][神经网络]]
+ [[file:improvement/improvment.org][改善调优]]
+ [[file:structure/structure.org][结构化]]
+ [[file:convolutional/convolutional.org][卷积神经网络]]
+ [[file:sequence/sequence.org][序列模型]]
