html/ml/deep-learning/deep-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>深度学习入门</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">深度学习入门</h1>
<p>
深度学习改变了传统互联网业务，例如如网络搜索和广告。但是深度学习同时也使得许多新产品和企业以很多方式帮助人们，从获得更好的健康关注。
</p>

<pre class="example" id="org8a8e0ef">
深度学习做的非常好的一个方面就是读取X光图像，到生活中的个性化教育，到精准化农业，甚至到驾驶汽车以及其它一些方面
</pre>

<p>
AI是最新的电力，大约在一百年前，社会的电气化改变了每个主要行业，从交通运输行业到制造业、医疗保健、通讯等方面，如今我们见到了AI明显的令人惊讶的能量，带来了同样巨大的转变。显然，AI的各个分支中，发展的最为迅速的就是深度学习。因此现在，深度学习是在科技世界中广受欢迎的一种技巧
</p>

<ol class="org-ol">
<li><p>
第一章节中（神经网络和深度学习）：学习神经网络的基础
</p>
<pre class="example" id="org30957c0">
在第一门课程中，将学习如何建立神经网络（包含一个深度神经网络），以及如何在数据上面训练他们

在这门课程的结尾，将用一个深度神经网络进行辨认猫
</pre></li>
<li><p>
第二章节：进行深度学习方面的实践，学习严密地构建神经网络，如何真正让它表现良好，因此要学习 <span class="underline">超参数调整</span> 、 <span class="underline">正则化</span> 、 <span class="underline">诊断偏差</span> 和 <span class="underline">方差</span>
</p>
<pre class="example" id="org6548d96">
一些高级优化算法，比如Momentum和Adam算法，犹如黑魔法一样根据你建立网络的方式
</pre></li>
<li><p>
第三章节：学习如何结 <b>构化</b> 你器学习工程。事实证明，构建机器学习系统的策略改变了深度学习的错误
</p>
<pre class="example" id="orgf1343b2">
举个例子：分割数据的方式，分割成训练集、比较集或改变的验证集，以及测试集合，改变了深度学习的错误

最好的实践方式是什么呢？训练集和测试集来自不同的贡献度在深度学习中的影响很大，那么应该怎么处理呢？
</pre></li>
<li><p>
第四章节：会提到 <b>卷积神经网络</b> <span class="underline">CNN(s)</span> ，它经常被用于 <span class="underline">图像领域</span>
</p>
<pre class="example" id="org0c137d2">
将会学到如何搭建这样的模型
</pre></li>
<li><p>
第五章节：会学习到 <b>序列模型</b> ，以及如何将它们应用于 <span class="underline">自然语言处理</span> 。序列模型包括的模型有 <b>循环神经网络</b> <span class="underline">RNN</span> 、全称是 <b>长短期记忆网络</b> <span class="underline">LSTM</span>
</p>
<pre class="example" id="orgcb1b986">
比如说，自然语言就是一个单词序列

能够理解这些模型如何应用到语音识别或者是编曲以及其它问题
</pre></li>
</ol>

<p>
因此，通过这些，将学习深度学习的这些工具，将能够去使用它们去做一些神奇的事情
</p>

<ul class="org-ul">
<li><a href="neural-network/neural-network.html">神经网络</a></li>
</ul>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
